user-4.0/tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgsBlock2D/system/region_dynamic/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                               none;
}

gradSchemes
{
    default                               none;
    snGradCorr(cellMotionU)               leastSquares;
}

divSchemes
{
    default                               none;
}

laplacianSchemes
{
    default                               none;
    laplacian(diffusivity,cellMotionU)    Gauss linear corrected;
}

interpolationSchemes
{
    default                               none;
    interpolate(y)                        linear;
}

snGradSchemes
{
    default                               none;
}

// ************************************************************************* //
